Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: sutg** 보기 좋네용!!!
en_us: sutg** you both look great!!!

source: 시아짱을 위해서라면 무엇이든지...!!
en_us: for sia-chan... I can do anything!!!

source: 다이어트 중인데
en_us: he’s supposed to be dieting!

source: 너 없으면 난 누구랑 놀아!!!!
en_us: who am I supposed to play with now?!!!!

source: 93kg
en_us: 205 lbs

source: 후욱- 후욱-
en_us: WHEW WHEW

source: 퍽
en_us: WHACK

source: 빤-히
en_us: STARE

source: 살 진짜 많이 빠지셨네요!
en_us: you really lost a lot of weight!

source: 조회수 달달하겠당~
en_us: hehe, we should be able to get lots of views!

source: 이미지 관리나 잘 해.
en_us: so be careful.

source: 남자친구?
en_us: boyfriend?

source: 그래도 요즘 유행하는 룩들로 준비했으니까,
en_us: I picked out what’s trendy nowadays...

source: 이제 걷기 운동 하고 와야 되는데…
en_us: I need to go out for a walk...

source: 게다가 난 앞날이 창창한 고등학생이고!
en_us: besides, I’m still a high schooler with a bright future ahead!

source: 윤시아, 백시원이지!
en_us: ...sia yoon and siwon baek!

source: 힉
en_us: GASP

source: 이상하자나~
en_us: it’s odd.

source: 알고싶지 않아...
en_us: tmi...

source: 게임
en_us: GAME

source: 뭘 봐, 뭐 어쩌라고!
en_us: what are you staring at, huh?!

source: 새로 바뀐 식단은 어때, 마음에 들어?
en_us: you like the new meal plan?

source: 백시원과 헤어진지 2주가 흘렀고,
en_us: after two weeks passed since our breakup...

source: 내가 남자친구가 아닌 사랑이랑
en_us: why am I spending christmas...

source: 백시원 네가 감히 날 차!!??
en_us: siwon baek! how dare you dump me?!?!

source: 그거 설마…
en_us: could it be...?

source: 휴…
en_us: phew...

source: (에바참치게리온op)
en_us: (Ebatunagetiron op)

source: 궁금하면 인터넷에 검색해봐, 윤시아라고.
en_us: if you’re curious, just look up “sia yoon” online.

source: 돌려 주라굿!!
en_us: give it back!

source: 모양이 살아있는 단단한
en_us: Great Source of Protein

source: ㅋㅋㅋ 아깝긴 하다~
en_us: hahaha, that’s very true!

source: 우, 우와아!!!
en_us: wh-whoaaa!!!

source: 싸우고 있길래…
en_us: you two were arguing...

source: 동영상 클리에이터
en_us: Video Creator

source: 이 외에도 새로운 규칙들이 많이 생겼고,
en_us: aside from all this, he had to follow new rules.

source: 으, 으으...!!
en_us: o-okay!!!

source: 우와 이건 진짜 별로다…
en_us: oh, wow. that looks horrible...

source: 그녀의 마음을 뺏고 싶다 이거지?
en_us: ...you want to steal her heart?

source: 크, 크리스마스 선물!!??
en_us: a-a christmas gift?!!!

source: 얼굴 진짜 작다...
en_us: her face is so adorable...

source: 오하요...
en_us: ohayo (good morning)...

source: 다름이 아니라 광고 부탁드
en_us: We just wanted to check in

source: 헤에…
en_us: yum

source: 낙서라도 해주세요~
en_us: then just a scribble will do!

source: 와아앙~
en_us: WAAAAH

source: 더 채우면 돼 1 2 3 4~
en_us: to fill 1 2 3 4~

source: 꺄~ 귀여워!
en_us: kyahhh! so cute!

source: 혼자서 어떤 콘텐츠를 찍어야 할지 모르겠어...!
en_us: I don’t know what kind of content I should create by myself!

source: 뭐야,
en_us: what?

source: 조건이 있어.
en_us: ...on one condition.

source: 꿀꺽 꿀꺽
en_us: GULP GULP

source: 크윽...
en_us: hic...

source: 아이고 아가야...
en_us: Oh dear child...

source: 일어나자마자 각종 SNS에 본인 이름을 검색해본다.
en_us: ...and immediately searches her own name on social media.

source: 시아 친구 김민호입니다만!!!!
en_us: I’m minho kim! sia’s friend, sir!!!!

source: 너 안경 좀 벗어봐!
en_us: take off your glasses!

source: 아, 네… 맞아요.
en_us: oh, yes... that’s me.

source: 아아...!
en_us: uhhh...

source: 그래, 네 말이 맞아 민호킁!!
en_us: yes, you’re right, minho-kun!!!

source: 윤시아!!
en_us: sia yoon!!!

source: 그럼 어떡해, 3개월 안에 변한 모습을 보여줘야 하는데!
en_us: what else can we do? we only have three months!

source: 윤시아고 뭐고, 애를 저렇게 굶겨도 되는 거야?
en_us: that darned sia! why starve the kid like that?!

source: 해피 키즈카페
en_us: Happy Kids Playground

source: 꾸어어어
en_us: ERRRRGH

source: 그게 실은...
en_us: to be honest...

source: 그런데 너 머리 자를 때 되지 않았어?
en_us: hey, shouldn’t you cut your hair?

source: 그릭 요거트에 과일을 얹어 먹으며 시원이를 기다려요.
en_us: ...I have some greek yogurt topped with fruit as I wait for siwon.

source: 아까 대충이라도 치워놔서 다행이다.
en_us: good thing I kind of cleaned up earlier.

source: 어떠셨어요, 오늘 재밌었쬬?
en_us: how was it? did you enjoy it?

source: 눈에 보이는 너야, 김민호.
en_us: it’s how you see yourself, minho.

source: 아, 내가 갑자기 끼면 성황쿤?
en_us: oh, if I suddenly join, then will that guy...

source: 화제가 될 줄은 알았지만 이정도라니...!!!
en_us: I knew it would blow up, but not this much!!!

source: 말하자면 너무 긴데...
en_us: it’s a long story...

source: 알았어...
en_us: okay...

source: 민호는 일상으로 돌아왔다.
en_us: ...minho was back to his normal routine.

source: 나오는 과정은 조금 귀찮지만
en_us: sometimes, I don’t feel like leaving the house...

source: 다들 성질 급하시네!
en_us: hear me out, everyone!

source: 오래 하네
en_us: you must like it a lot.

source: 넘쳐난다는 것을…
en_us: ...there will be.

source: 개명했어~ 중학생 때.
en_us: I changed my name in middle school.

source: 밤만 되면 돌변한다.
en_us: ...becomes a different animal at night.

source: 내가 안 간다고 했어.
en_us: so I said I wouldn’t go.

source: 뭐, 뭐야 그 반응은…
en_us: wh-what’s with that response?!

source: 나한테 상의도 없이 윤시아를 데려오면 어떡하자는 거냐!!!
en_us: how can you bring sia without even discussing it with me?!!!

source: 그 땐 처음이니 많이 빠진 거고…
en_us: that’s because it was just the beginning back then...

source: 보여주는 거냐고!!
en_us: are you showing off?

source: 세상이 미치긴 했나보다.
en_us: the world must be mad.

source: 쟤랑 같은 반 될 애들 부럽다...
en_us: I’m jealous of the class he’ll be in...

source: 조금 더 적극적으로 다이어트에 참여하게 되었다.
en_us: ...minho followed his dieting regimen more proactively.

source: 백시원 그 녀석은 삐쩔 말라가지고 보기 싫더니…
en_us: that kid siwon was way too skinny and frail...

source: 꼬르르륵
en_us: GRRROWL

source: 휴우~ 겨울 따돌렸다.
en_us: phew! we barely lost them.

source: 안 그래도 존x 짜증나니까!
en_us: I’m already friggin’ irritated enough right now!

source: 난 네가 아는 그 윤시아
en_us: I’m sia yoon, as you probably already know...

source: 지, 지겨워…!!
en_us: I-I’m sick of this!!!

source: 3구민선배님
en_us: Sam Gumin

source: 겉보기에는 많이 빠져 보이는데…
en_us: even though it’s obvious that he lost a lot of weight just from a glance...

source: 9.4천 싫어용 공유 다
en_us: 9.4K Dislike Share Do

source: 얘랑...
en_us: he...

source: 시아쨩~
en_us: sia-chan!

source: 고백 장소에 갑자기 전남친이 나타나 싸움이 붙더라...
en_us: her ex suddenly showed up where I prepared the event and they started fighting...

source: 몸이 너무 둔해...!!!
en_us: my body’s too heavy and slow!!!

source: 이상하다…
en_us: that’s odd...

source: 마이크 주세요!
en_us: mic, please!

source: 기분 좋아보인다?
en_us: you look like you’re in a good mood.

source: 열심히 하겠습니다.
en_us: thank you, sir. I’ll do my best.

source: 뷰티 뉴튜버?
en_us: a beauty newtuber?

source: 자, 인사해 김민호!
en_us: here, say hello, minho!

source: 에ㅔㅔ엥에ㅔ엑!?!?
en_us: huuuuuuh?!!!

source: 에, 에엣!?
en_us: h-huh?!

source: 시아에게 어울리는 남자가 되고 싶어!
en_us: I want to be the type of guy she deserves!

source: 시아쨩과 어울리는 남자가 되는 거야...!
en_us: ...I will be the type of boy that sia-chan deserves!

source: 나도 헷갈렸어!
en_us: that’s because I was confused!

source: 저 깐깐한 놈이 칭찬이라니, 너 오늘 진짜 잘했나보당~!
en_us: a compliment from that uptight kid? you must’ve done really well!

source: 아직 집을 다 치우지 못했는데...
en_us: I haven’t finished cleaning yet...

source: 어어...?
en_us: h-huh?

source: 네가 좋아하는 초코 소라빵 사줄테니까!
en_us: I’ll treat you to a chocolate pastry! you like those a lot!

source: 헤헷!
en_us: HEHE

source: 너 다이어트 안 할 거야?
en_us: I thought you were going to lose weight!

source: 머리를 깔끔하게 올리고, 깔끔하게 씻고 가라고!
en_us: so take a shower and comb your hair before you go to her!

source: 백시원 니가 여기서 이러고 있으면 안 되는 거잖아!!!
en_us: siwon, how can do this?! here of all places?!!!

source: 1kg…?
en_us: and only two pounds?

source: 저 녀석...
en_us: oh, he’s...

source: 지금 뭐하는 거야, 너 때문에 흥이 깨지고 있잖아!!
en_us: what are you doing?! you’re ruining the mood!!!

source: 헿
en_us: HEHE

source: 이거 언제까지 해야 해!?
en_us: how much longer do I need to do this?!

source: 크흠…그런 거라면 뭐…
en_us: ahem... in that case...

source: 아아, 그거?
en_us: oooh, that?

source: 살이 빠지는 것 같은 기분이 들어!!!
en_us: ...but it sounds like I’m losing weight!!!

source: 생각해둔 거 있겠지?
en_us: you thought about it, right?

source: 그렇다면 난...
en_us: what...

source: 사, 살려줘!!!
en_us: s-save me!!!

source: 난 혼자가 아닌걸~
en_us: because I’m not alone~

source: 매 끼니 식단마다 전부 검사를 받게 되었다.
en_us: he also has to get mansik’s approval for every meal he eats.

source: 민호를 공개함과 동시에 기존의 구독자들이 대거 빠져나가고.
en_us: as soon as she revealed minho, a large chunk of subscribers unsubscribed.

source: 하, 하잇!!
en_us: o-ouch!!!

source: 이럴 때 누가 명쾌하게 방법을 알려주면 좋을텐데...
en_us: it’d be nice if someone could teach us a very clear, easy way to do this...

source: 오오, 많다~
en_us: oooh! you have a lot of them!

source: 정말 이대로 끝이야..!?
en_us: are we really breaking up?!

source: 내일 체중체크네?
en_us: tomorrow’s your weigh-in!

source: 무슨 상황인지는 모르겠지만…
en_us: I’m not sure what that’s about...

source: 17세 인생의 최초이자 최고의 이벤트였다.
en_us: ...was the first big event in his entire 17 years of life.

source: 삼시세끼 다 먹되, 끼니 시간 외에는 음식 먹지 않기 (간식, 야식 금지!)
en_us: eat all three meals, but snacking between meals and late-night snacks are prohibited!

source: 그 때 생각만 하면 자다가도 이불킥 한다고~
en_us: thinking back on that day still humiliates me even now!

source: 잘 할 수 있을진 모르겠지만 뭔가...
en_us: I don’t know whether I’ll do well...

source: 건강하게 잘 자랐어.
en_us: you grew up to be very healthy!

source: 쟈-응 고쿠나 (잔혹한)
en_us: ra-ikuwa (like a)

source: 이 나쁜 놈아!!!!
en_us: you jerk!!!!

source: 괴물 신인 발굴 하는 건가~
en_us: ...will debut a superstar rookie!

source: 말했잖아.
en_us: I told you.

source: 잘 모르겠어.
en_us: I’m not sure.

source: 보여 줘!!
en_us: show me!

source: 몸에 안 좋은 라면이나 군것질 거리들을 모두 정리했고,
en_us: ...was clean out all the unhealthy instant noodles and snacks.

source: 아참, 누나 저녁은 집에서 먹을 거지?
en_us: by the way, you’re having dinner at home, right?

source: 자, 그럼 어서 재볼까?
en_us: well, then. let’s go on the scale!

source: 고, 고멘… 시아쨩이 큐브 몬스터를 꼭 같이 보고 싶다고 해서…
en_us: g-gomen... sia-chan really wanted to watch cube monsters with us...

source: 학생 5000원
en_us: STUDENTS $5

source: 뭔가 나 오늘...
en_us: today, I somehow...

source: 그런데 왜 같이 운동하고 싶다고 한 거야?
en_us: but why did you want to exercise together with me?

source: 이 낡고 초라한 집 밖에 없지.
en_us: ...is this old, worn-down house.

source: 그럼 너도 걔가 좋아하는 걸 해줘.
en_us: then do something for him that he would like.

source: 맞네,
en_us: oh, right.

source: 굶어서 뺸 살은 반드시 다시 올아와.
en_us: the weight you lose by starving yourself will always come back.

source: 스트레스를 받을 수록 습관이 무너지기 쉬우니까!
en_us: if you stress yourself out, it’ll be tempting to go back to your old habits!

source: 잠깐, 근데...
en_us: but wait...

source: 내가…
en_us: I can’t believe...

source: 작곡 김이김이나
en_us: Composed by: GimmeGimmeYou

source: 걔랑 내라 헤어진게 언젠데...!!!
en_us: he and I broke up long ago!!!

source: 내 남친 킹카만들기 프로젝트 시작!!
en_us: “my dud to stud boyfriend” project begins!!!

source: 오빠 오늘 운동 못 나갈 것 같은데...
en_us: I don’t think minho can go exercise today...

source: 샤랄라~
en_us: TA DAH

source: 그럼 난 갔다올게!
en_us: I’m off now! see you!

source: 여친?
en_us: his girlfriend?

source: 정말… 잘 컸구나, 잘 컸어!!!
en_us: you’ve really... grown well! very well!!!

source: 운동 잘 했어?
en_us: how was your workout?

source: 야, 백시원이랑 윤시아 진짜 헤어졌대...대박...
en_us: hey, big news! I heard siwon and sia really broke up...

source: 미안 성환쿤, 나 나가봐야 될 것 같아 ㅠ
en_us: sorry seonghwan-kun. i gotta go now :’-(

source: …그래.
en_us: sure...

source: 대한민국육군 ROKA
en_us: ROK ARMY

source: 요리 실력도 꽤 늘었고, 전보다 건강해진 것 같달까...
en_us: my cooking skills have improved and I feel a lot healthier.

source: 민호는 견뎌냈다.
en_us: minho successfully held back.

source: 친구들과^^
en_us: my friends :)

source: 으아아아
en_us: AAARGH

source: 그럼 뭐하냐?
en_us: what good is it, though?

source: 미소가 귀엽던 그 때의 모습을,
en_us: I remember his cute smile.

source: 윤시우(16세) 시아 남동생
en_us: siu yoon, 16 years old sia’s younger brother

source: 기분 좋아보이네,
en_us: minho...

source: ...뭐...?
en_us: what...?

source: 솔직하게 말해서…
en_us: honestly...

source: 그래 그래, 조회수 잘 나온 건 좋은데...
en_us: yeah, yeah. it’s great that you got so many views...

source: 김민호 멋있다~!!
en_us: minho! you’re so cool!!!

source: 질질
en_us: DRAG

source: 아찔
en_us: ugh...

source: 왔냐!?
en_us: you’re here?!

source: 제발 헛소리 좀 그만해!
en_us: will you quit your nonsense already?

source: 2시간
en_us: 2 hours ago

source: 하여간...{j}덕후들은 이해할수가 없어
en_us: I really don’t understand anime nerds...{j}

source: 다시 생각해봐 갑자기 왜?
en_us: why, all of sudden? let’s think this over.

source: 뭐, 뭐어어어?
en_us: wh-whaaat?

source: 아픈 기억을...
en_us: you hit me right where it hurts...

source: 쟤 내 남동생이야, 이름은 윤시우고…
en_us: he’s siu, my younger brother...

source: 그럼 많이 먹어 시아쨩!!
en_us: dig in, sia-chan!!!

source: 오전 11:20
en_us: 11:20 AM

source: 그냥 오늘은 심심해서 부른 거야!!
en_us: I just called you out because I was bored!!!

source: 훨씬 보기 좋구나!!!
en_us: you look so great now!!!

source: 이쁜곳
en_us: Great Place

source: 내 남친 킹카만들기 였던가...
en_us: “my dud to stud boyfriend,” was it?

source: 참나, 내가 왜!?
en_us: ha! why should I?!

source: 그 날에 진짜 재미있게 놀자!!
en_us: let’s have lots of fun that day!!!

source: 하지만 견뎌야 해…!
en_us: but I have to hold back!

source: 친구도 없이 쉬는 시간에 혼자 앉아 있었는데…
en_us: ...I was sitting alone during break time because I didn’t have any friends.

source: 무서워...
en_us: I’m scared...

source: 초롱 초롱
en_us: SPARKLE SPARKLE

source: 으으… 너무 춥다.
en_us: ugh... it’s so cold.

source: 이번에 보면 한 마디 해줘야겠어!!
en_us: I’m going to have a talk with him when he gets here!!!

source: 체중을 재는 날이 왔다.
en_us: it was now time to measure his weight.

source: 표준이하/ 표준/ 표준 이상
en_us: Below Standard Standard Above Standard

source: 너 나랑 사귈래?
en_us: wanna be my boyfriend?

source: 와~ 여기가 네 집이구나~
en_us: wow! so this is your place, huh?

source: 난 관심 없어.
en_us: whatever.

source: 뉴튜브 진짜 뭐 찍냐...
en_us: what should I film now...?

source: 첫 번째!
en_us: first!

source: 민호 잘 했어, 오늘?
en_us: did minho do well today?

source: 힝
en_us: ACK

source: 곧 11층 가겠네...
en_us: but you might hit half a ton soon...

source: 시, 시아쨩이…
en_us: s-sia-chan is...

source: 너무 허무해...!
en_us: what a waste!

source: 이거지, 이거~!!
en_us: this really hits the spot!!

source: 헬스도 시작했고…밥도 계속 적게 먹고 있는데…
en_us: I started working out at the gym and consistently ate less...

source: 헬스 + 뷰티?
en_us: health + beauty?

source: 내 친구를 맡겨도 되겠어.
en_us: ...but now, I think I can entrust my friend to her.

source: 뭐, 뭐야!?
en_us: wh-what-! what are you wearing?

source: 아참, 그리고 이번에 온바디도 재봤는데…
en_us: oh, and we checked his body measurements again...

source: 모르면 실례라구, 요즘 정말 핫한 신인 걸그룹 노래인데!
en_us: how can you not know? this song is by the hottest new girl group!

source: 꽉
en_us: GRIP

source: 최만식은 이런 날 단 둘이 만날 만큼 친하진 않단 말야...!!
en_us: and I’m not close enough with mansik to meet up with him on a day like this!!!

source: 그냥… 네가 그렇게 열광하니까…
en_us: it’s just... you’re so enthusiastic about it...

source: 뭘 해야 하지!?
en_us: ...should I do now?!

source: 네~ 다음에 또 놀러 오세요~ ㅎㅎ
en_us: yes, come again! hehe.

source: 복권판매
en_us: Lottery Sold Here

source: 끄으으
en_us: ERGH

source: 간다.
en_us: cess.

source: 내가 잘 따를 수는 있을까...?
en_us: ...but will I be able to follow through?

source: 어차피 쟤 옷이랑 화장품도 전부 협찬 빨이고,
en_us: she gets all her clothes and makeup from ads.

source: 드디어 우리 회사도
en_us: finally, our company...

source: 쟤네 집 거지인 거 모르는 사람도 있어?
en_us: everyone knows her family is from the dumps!

source: 왜!!
en_us: why?!

source: 꺄!!
en_us: kyaaah!!!

source: 그놈 다리 몽뎅이를 아주 그냥!!!
en_us: I should break that brat’s leg!!!

source: 저 이제 성공한 거 맞죠!?
en_us: then this should work, right?

source: 운동해야지 그럼, 헬스장인데.
en_us: of course we’re going to exercise.

source: 댓글 1222개 모두 보기
en_us: View all 1222 comments

source: 아, 뭐야 누나 친구였어?
en_us: oh, he’s your friend?

source: 네, 네가…
en_us: th-that kid...

source: 어쩔 수가 없었어.
en_us: because of a family matter.

source: 지금 당장 사귄다는 게 아니구요!
en_us: we’re not going to start dating right away!

source: 굶지도 않았는데,
en_us: I didn’t starve myself...

source: 저 수많은 인파 속에서 매니저 역할이나 하고 있었다니…!!
en_us: ...I had to act like a manager amidst that crowd of people!!!

source: 조회수 7.6만회 3개월 전 #다이어트 #전신유산소 #층간소음X
en_us: 76K views 3 months ago #weightloss #fullbodyworkkout #nonoise

source: 진짜… 신선한 경험이었다…
en_us: that was... a really new experience...

source: 또 아무 생각 없이 일 벌인 거지?
en_us: did you even think this through properly?

source: 왜 난 여전히 돼지인 거냐고오!!!
en_us: why am I still a pig?!!!

source: 조금만 더 하면 대기업 될 수 있었단 말야!!!
en_us: we were on the verge of becoming a huge conglomerate!!!

source: 약속하나 잡는게 왜 이렇게 힘들어?
en_us: why is it so difficult to meet up with him?

source: 우와~ 회원님 나이스~
en_us: wow! look at him go!

source: 땡큐베리 감사지만!
en_us: ...of course you can!!!

source: 으, 으응!
en_us: o-okay!

source: 그럼…
en_us: then...

source: 보고싶다 시원앙ㅠㅠ
en_us: I miss you, Siwon! :((

source: 그 만화가 그렇게 재밌어?
en_us: is anime that much fun?

source: 오늘 일…
en_us: about what happened today?

source: 백시원 이용하다가 차이니까 학교 친구 이용해서 구독자 수 늘리려는 거 속
en_us: u used siwon baek at first and now that he dumped u, ur using another school friend to get more subscribers?

source: 썰~렁
en_us: WHOOSH

source: 최근 들어 가장 들떠있는 상태인데...
en_us: he was in higher spirits than usual.

source: 그정도야…?
en_us: is it that bad?

source: 립 뭐 쓸까?
en_us: I wonder what lip tint she uses.

source: 아무튼 내일은 등이랑 이두 조질 거니까, 집 가서 다리 마사지 해주고!
en_us: anyway, we’re going to workout your back and biceps tomorrow. and don’t forget to massage your legs at home!

source: 가장 쉬운 방법이 하나 있잖아.
en_us: there’s a really easy way!

source: 훅 후욱 훅
en_us: HUFF HUFF HUFF

source: 겨울방학부터 특훈을 시작하기로 했거든...
en_us: I’m starting special training during winter vacation...

source: 그건 그래…
en_us: true...

source: 오타쿠란 이유로 괜히 무시하고 기분 나빠하고…
en_us: I looked down on him and didn’t like being near him, merely because he was a geek...

source: 깔깔유머
en_us: Giggle Humor

source: 2주동안…
en_us: two weeks...

source: 대충 어떤 식습관을 가졌는지는 알 것 같아.
en_us: I can tell what his eating habits are like.

source: 바보야!
en_us: you dummy!

source: 가, 같이 가~
en_us: w-wait for me!

source: 조금 무리하긴 했지만...
en_us: I know it was hard...

source: 아닙니다.
en_us: thank you,

source: 들키겠다!
en_us: they might find us!

source: 극장판 큐브 몬스터
en_us: Cube Monster The Movie

source: 지금의 김민호가...
en_us: this boy in front of me...

source: 브 몬스터
en_us: Cube Monster The Movie

source: 맞다!
en_us: oh, right!

source: 이러지 마...!
en_us: stop...!

source: 민호는 지금 체중 감량 중이니?
en_us: is minho trying to lose weight?

source: 이게 무슨 개소리야…
en_us: sounds like a dog barking...

source: 취소 시작
en_us: Cancel Start

source: 지금이라도 찍어서 올려야겠다...
en_us: I should get it done now.

source: 싸운 거 같던데...
en_us: I think they fought...

source: 거기 새로 생긴 디저트 카페가 있는데~
en_us: and a new dessert cafe just opened there!

source: 마, 말도 안 돼!!!
en_us: n-no way!!!

source: 선생님 보고싶을 거예요~~~
en_us: we’re gonna miss you, teacher!!!

source: 에반데..요즘은 개나소나 메이크업 뉴튜브 하네ㅋㅋ
en_us: this is overkill...everyone’s hopping on the makeup tutorial bandwagon nowadays lol

source: 그래~
en_us: okay!

source: 어, 어떻게요...!?
en_us: b-but... how?!

source: 너, 너무해...
en_us: s-so mean...

source: 민호는 이제 일요일 하루를 제외한 모든 날에 헬스장에 나와
en_us: now, minho works out at the gym every day except sunday...

source: 그러니까 저희 오빠 좀 잘 부탁드려요...!
en_us: please, help minho!

source: 최만식(17)
en_us: mansik choi, 17 years old

source: 너희들 할 짓 없으면 교실가서 책이나 읽어!!
en_us: go read a book if you have nothing better to do!!!

source: 내 사랑엔 핑크가 버블버블!
en_us: pink bubbles up in my love~

source: 퀭...
en_us: DUN

source: 에이~
en_us: awww

source: 에엣-!?
en_us: huuuh?!

source: 시시커플 ww isicouple
en_us: SISI Couple ww isicouple

source: STUDY WITH ME{j}같이 공부해요!
en_us: STUDY WITH ME!{j}

source: 카메라 없어.
en_us: there aren’t any.

source: 카메라는 어디 숨겼대.
en_us: but where are the cameras?

source: 김민호 너...
en_us: minho kim...

source: 그지같은 벽지 때문에 집에서 셀카를 찍어서 올리지도 못 해.
en_us: I can’t take any selfies at home because of this ugly wallpaper.

source: 뭐야, 슈넬 클래식 백?
en_us: a chunel classic bag?

source: 그런 거 아니야!!
en_us: that’s not what I meant!!!

source: 내가 시아쨩도 온다고 말 안했던가?
en_us: didn’t I tell you sia-chan would join us?

source: 여러분께 알려드릴 중대 소식이 있어 급하게 라이브를 켰습니다!
en_us: I’m livestreaming today because I have a very important announcement!

source: 목숨보다 소중히 여기는 '나코짱'을 감히 인간 여자에게 비빈다고!?
en_us: ...comparing a mere human girl with nako-chan? that very nako-chan that he loved more than his own life?!

source: 우리들의 필수코스인 노래방도 함께 즐겼잖아.
en_us: ...and even enjoyed karaoke together, which is a must-do for us geeks.

source: 옆엔 삼촌인가요?
en_us: is that your uncle?

source: *응원상영관임
en_us: *currently in a special movie theater

source: 그럼 스트레칭 시작할까?
en_us: then let’s start stretching.

source: 매점에서 본 시끼들한테 맞은 거지!!
en_us: was it the jerks from the store that time?!

source: 연애(시뮬레이션게임) 고수 오성환에게...!!!
en_us: I, seonghwan oh, am a dating (simulation game) master!!!

source: 턱살도 좀 줄어들긴 했네.
en_us: and he even lost a chin or two.

source: 보배한테도 말 안 할 거야?
en_us: you’re not going to tell bobae either?

source: 첫 영상부터 이정도란 건 화제성은 이미 꽉 잡았다 이거지!
en_us: since his first video blew up like that, it means he’s already a hot topic!

source: 콕
en_us: TAP TAP

source: 오랜만에 가족끼리 크리스마스 파티 하는 수밖에!!!
en_us: let’s have a family christmas party! it’s been a while since we’ve had one!!!

source: 싱글 싱글
en_us: SMIRK SMIRK

source: 아, 아니야!
en_us: b-but!

source: 저걸 입혀볼까…?
en_us: I wonder how that would look...

source: 그냥 그 이벤트 남이랑 잘 해봐~
en_us: ...why don’t you just give it a go with that candle boy?

source: 숏츠에도 올리자~
en_us: we can post it as a short vid!

source: 백시원 보다 조회수 잘 나올 듯.
en_us: he might actually get you more views than siwon did.

source: 이글 이글
en_us: RAGE RAGE

source: 으응~
en_us: bye.

source: 기다려라, 골드 버튼아!!!
en_us: gold button, here I come!!!

source: 안 그랬으면 또 이 짓거리를 반복했겠지!
en_us: otherwise, he would’ve done this over and over again!

source: 백시원이랑 내가...
en_us: that’s where siwon and I...

source: 나 배고파… 밥 줘…
en_us: I’m hungry... give me food...

source: 으득...
en_us: GRIT

source: 히에엑!?
en_us: eeeek!!!

source: 헤헤, 미안 미안~ 얘가 느려 터져서~
en_us: hehe, sorry! he was so slow...

source: 어, 시아 왔어?
en_us: oh? hey, sia!

source: 으아, 늦겠다~!!
en_us: ahhh! I’m late!!!

source: 보다시피 전교생의 관심을 한 몸에 받고 있지!
en_us: as you can see, everyone at school knows who I am!

source: 나한테 떨어지는 이득이 없잖아.
en_us: I have nothing to gain from it.

source: 어맛 깜짝야!
en_us: oh, geez! you scared me!

source: 네가 드디어 미안한 감정을 느끼는 구나.
en_us: finally. now you feel sorry.

source: 혹시 다른 사진은 더 없어?
en_us: do you have any other pictures?

source: 우리가 왜 잘생긴 시원오빠 보다가 이딴 거나 보고 있어야 함?
en_us: I was here to watch my handsome Siwon. Why do I have to put up with this?

source: CCTV 촬영중입니다
en_us: Video recording in progress.

source: 13시간 전
en_us: 13 hours ago

source: 너 이제 들어가, 춥잖아.
en_us: you should go back now. it’s cold.

source: 식단이든, 운동이든 뭐든 변화를 주는 게 좋아.
en_us: it can be your meal plan or workouts.

source: 너무 멋있어!!!
en_us: she’s so cool!!!

source: 가만 보면...
en_us: now that I look at him...

source: 허락받고 선물 해주는 사람은 또 처음이네…
en_us: no one has ever asked for permission to give me a gift...

source: 어, 어...!?
en_us: uh, huh?!

source: 으아앙
en_us: WAAAH

source: 아아~ 걔네들?
en_us: oh, them?

source: 그건 잘 알겠는데...
en_us: I get it now.

source: 저녀석들 또 나 없는 틈 타서 너 괴롭히러 왔구만?!
en_us: they came to bully you while I was gone, didn’t they?!

source: 6화
en_us: Episode 6

source: 나 방법 찾았어!!
en_us: I found the answer!!!

source: 나에겐…
en_us: I...

source: 내가 킹카 같은 거 될 수 있을리가 없잖아...
en_us: ...there’s no way that will ever happen.

source: 아, 안녕…
en_us: h-hi...

source: 자아~섯끼츄!
en_us: setkichu!

source: ... ...{j}에..
en_us: uh...{j}

source: 셀카 어프
en_us: selfie app

source: 오늘 유산소 개 열심히 조졌다!!!
en_us: I totally aced my cardio today!!!

source: 이름이 달랐어...
en_us: her name was different...

source: 혹시 조금 더 건강한 방법으로 바꿔주실 수...
en_us: would it be possible to try a healthier way of dieting?

source: 나랑 가장 친한 친구인 성환쿤을 소개시켜 주고…
en_us: I got to introduce my best friend, seonghwan-kun, to you...

source: 매일 너 운동하는 거 구경만 하기 뭐하잖아.
en_us: I felt awkward only watching you exercise.

source: 난 기다리게 하는 남자는 딱 질색이니까 알아둬!
en_us: I hate guys that make me wait. remember that!

source: 저, 저 발차기는...!!!
en_us: th-that kick-!!!

source: 골격근량 kg
en_us: Muscle lbs

source: 난 잘 하고 있다구!
en_us: ...so I’m doing just fine!

source: 나닛!?
en_us: o-oh, no!

source: 말이 아주 안 되는 것 같진 않은데...?
en_us: it isn’t complete nonsense...

source: 참여만 해준다면야!
en_us: as long as you join us!

source: 응...
en_us: ye...s...

source: 어이~ 미미쨩~
en_us: oy! mimi-chan!
